#!/bin/bash

if [ "$1" == "" ]
then
echo "You forgot to add an IP Address"
echo "Syntax : ./ipsweep.sh 192.168.7"

# Functions as a Simple IP Sweeper ->

else
echo " "
echo "------------------- IP SWEEP -------------------"
echo " "
for ip in `seq 1 254` ; do
ping -c 1 $1.$ip | grep "64 bytes" | cut -d " " -f 4 | tr -d ":" &
done > ipSR.txt

for ip in $(cat ipSR.txt); do echo $ip; done


# This Part below Runs NMAP for Ports ->

echo " "
echo "--------------------- NMAP ---------------------"
echo " "

for ip in $(cat ipSR.txt); do nmap $ip; done 
echo " "
echo "
██████╗░░█████╗░███╗░░██╗███████╗
██╔══██╗██╔══██╗████╗░██║██╔════╝
██║░░██║██║░░██║██╔██╗██║█████╗░░
██║░░██║██║░░██║██║╚████║██╔══╝░░
██████╔╝╚█████╔╝██║░╚███║███████╗
╚═════╝░░╚════╝░╚═╝░░╚══╝╚══════╝"
fi
